In [1]:
import pandas as pd

In [2]:
l=[12,45,6,89]

In [3]:
ser=pd.Series(l)

In [4]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [5]:
ser

0    12
1    45
2     6
3    89
dtype: int64

In [6]:
L1=['AB','CD',3,4,5]

In [7]:
ser1=pd.Series(L1)

In [8]:
ser1

0    AB
1    CD
2     3
3     4
4     5
dtype: object

In [9]:
ind=[100,120,130,140,150]

In [10]:
ser2=pd.Series(L1,index=ind)

In [11]:
ser2

100    AB
120    CD
130     3
140     4
150     5
dtype: object

In [12]:
ser2[100]

'AB'

In [15]:
ser2[120]

'CD'

In [16]:
import numpy as np
arr=np.array([10,30,50,70])
ser4=pd.Series(arr)

In [17]:
ser4

0    10
1    30
2    50
3    70
dtype: int32

In [18]:
dct={'USA':1000,'FRNC':2000,'UK':3000,'IND':4000,'USSR':5000}

In [19]:
ser5=pd.Series(dct)

In [20]:
ser5

USA     1000
FRNC    2000
UK      3000
IND     4000
USSR    5000
dtype: int64

In [22]:
df=pd.DataFrame(data=L1)

In [23]:
df

    0
0  AB
1  CD
2   3
3   4
4   5

In [24]:
df1=pd.DataFrame(L1)

In [25]:
df1

    0
0  AB
1  CD
2   3
3   4
4   5

In [26]:
dct

{'USA': 1000, 'FRNC': 2000, 'UK': 3000, 'IND': 4000, 'USSR': 5000}

In [37]:
country=pd.DataFrame(dct,index=[0])

In [38]:
country

    USA  FRNC    UK   IND  USSR
0  1000  2000  3000  4000  5000

In [40]:
country['IND']

0    4000
Name: IND, dtype: int64

In [41]:
dct1={'USA':[1,2,3],'IND':[4,5,6],'USSR':[7,8,9]}

In [42]:
dct1

{'USA': [1, 2, 3], 'IND': [4, 5, 6], 'USSR': [7, 8, 9]}

In [43]:
df3=pd.DataFrame(dct1)

In [44]:
df3

   USA  IND  USSR
0    1    4     7
1    2    5     8
2    3    6     9

In [45]:
df3['USA']

0    1
1    2
2    3
Name: USA, dtype: int64

In [46]:
df3['IND']

0    4
1    5
2    6
Name: IND, dtype: int64

In [48]:
df3['USSR']

0    7
1    8
2    9
Name: USSR, dtype: int64

In [51]:
df3.iloc[0]

USA     1
IND     4
USSR    7
Name: 0, dtype: int64

In [52]:
df3.iloc[0:2]

   USA  IND  USSR
0    1    4     7
1    2    5     8

In [53]:
df3

   USA  IND  USSR
0    1    4     7
1    2    5     8
2    3    6     9

In [54]:
df3=pd.DataFrame(dct1,index=['A','B','C'])

In [55]:
df3

   USA  IND  USSR
A    1    4     7
B    2    5     8
C    3    6     9

In [56]:
df3.loc['A']

USA     1
IND     4
USSR    7
Name: A, dtype: int64

In [61]:
df4=pd.DataFrame([[1200,1400,1500],[2200,2400,2500],[3200,3400,3500]],index=['A','B','C'],columns=['Col1','Col2','Col3'])

In [62]:
df4

   Col1  Col2  Col3
A  1200  1400  1500
B  2200  2400  2500
C  3200  3400  3500

In [63]:
# operations
df4>100

   Col1  Col2  Col3
A  True  True  True
B  True  True  True
C  True  True  True

In [64]:
df4+100

   Col1  Col2  Col3
A  1300  1500  1600
B  2300  2500  2600
C  3300  3500  3600

In [65]:
bool_val=df4>1600

In [66]:
bool_val

    Col1   Col2   Col3
A  False  False  False
B   True   True   True
C   True   True   True

In [67]:
df4[bool_val]

     Col1    Col2    Col3
A     NaN     NaN     NaN
B  2200.0  2400.0  2500.0
C  3200.0  3400.0  3500.0

In [68]:
df4[df4>1600]

     Col1    Col2    Col3
A     NaN     NaN     NaN
B  2200.0  2400.0  2500.0
C  3200.0  3400.0  3500.0

In [69]:
print(type(df4))

<class 'pandas.core.frame.DataFrame'>

In [70]:
print(type(df4['Col1']))

<class 'pandas.core.series.Series'>

In [71]:
print(type(df4))

<class 'pandas.core.frame.DataFrame'>

In [72]:
print(type(df4['Col2']))

<class 'pandas.core.series.Series'>

In [74]:
print(type(df4['Col2'][0]))

<class 'numpy.int64'>

In [75]:
df4

   Col1  Col2  Col3
A  1200  1400  1500
B  2200  2400  2500
C  3200  3400  3500

In [76]:
print(df4['Col2']['B'])

2400

In [77]:
print(df4)

   Col1  Col2  Col3
A  1200  1400  1500
B  2200  2400  2500
C  3200  3400  3500

In [78]:
print(df3)

   USA  IND  USSR
A    1    4     7
B    2    5     8
C    3    6     9

In [79]:
import numpy as np

In [81]:
L2=[[100,200,300,400],[600,np.NaN,500,400],[600,np.NaN,np.NaN,400],[600,np.NaN,np.NaN,np.NaN]]

In [82]:
df6=pd.DataFrame(L2)

In [83]:
df6

     0      1      2      3
0  100  200.0  300.0  400.0
1  600    NaN  500.0  400.0
2  600    NaN    NaN  400.0
3  600    NaN    NaN    NaN

In [85]:
df6[0]

0    100
1    600
2    600
3    600
Name: 0, dtype: int64

In [86]:
df6[0:3]

     0      1      2      3
0  100  200.0  300.0  400.0
1  600    NaN  500.0  400.0
2  600    NaN    NaN  400.0

In [89]:
df6[[0,3]]

     0      3
0  100  400.0
1  600  400.0
2  600  400.0
3  600    NaN

In [93]:
df6[[0,1,3]]

     0      1      3
0  100  200.0  400.0
1  600    NaN  400.0
2  600    NaN  400.0
3  600    NaN    NaN

In [94]:
#head() -> frist five rows of DataFrame will be displayed
#tail() -> Last five rows of DataFrame will be displayed
#colums -> columns information of the DataFrame
#info() -> Information of the column of DataFrame

In [95]:
df4

   Col1  Col2  Col3
A  1200  1400  1500
B  2200  2400  2500
C  3200  3400  3500

In [97]:
df4.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [99]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
Col1    3 non-null int64
Col2    3 non-null int64
Col3    3 non-null int64
dtypes: int64(3)
memory usage: 176.0+ bytes

In [101]:
df4.shape

(3, 3)

In [102]:
df4.size

9

In [103]:
DF5=pd.read_csv(r'C:\Users\HP P DTS\Desktop\Python Classes\DataSet\EDA.csv')

In [104]:
DF5

    Eployee  YearOFExp     Sal
0      1001       1.00  1000.0
1      1002       1.50  1500.0
2      1003       1.00  1000.0
3      1004       2.00  2000.0
4      1005       2.25  2250.0
5      1006       3.00  3000.0
6      1007       1.00  1100.0
7      1008       1.50  1500.0
8      1009       1.75  1750.0
9      1010       4.00  4000.0
10     1011       2.00  2200.0
11     1012       2.25  2250.0
12     1013        NaN  3000.0
13     1014        NaN  3200.0
14     1015       3.00  3000.0
15     1016       5.00  4500.0
16     1018       3.50  3500.0
17     1019       3.00     NaN
18     1020       2.75  2750.0

In [105]:
DF5.head()

   Eployee  YearOFExp     Sal
0     1001       1.00  1000.0
1     1002       1.50  1500.0
2     1003       1.00  1000.0
3     1004       2.00  2000.0
4     1005       2.25  2250.0

In [106]:
DF5.tail()

    Eployee  YearOFExp     Sal
14     1015       3.00  3000.0
15     1016       5.00  4500.0
16     1018       3.50  3500.0
17     1019       3.00     NaN
18     1020       2.75  2750.0

In [107]:
DF5.describe()

           Eployee  YearOFExp          Sal
count    19.000000  17.000000    18.000000
mean   1010.157895   2.382353  2416.666667
std       5.871429   1.118445  1026.559073
min    1001.000000   1.000000  1000.000000
25%    1005.500000   1.500000  1562.500000
50%    1010.000000   2.250000  2250.000000
75%    1014.500000   3.000000  3000.000000
max    1020.000000   5.000000  4500.000000

In [108]:
DF5['Sal'].describe()

count      18.000000
mean     2416.666667
std      1026.559073
min      1000.000000
25%      1562.500000
50%      2250.000000
75%      3000.000000
max      4500.000000
Name: Sal, dtype: float64

In [109]:
DF5.describe().T

,count,mean,std,min,25%,50%,75%,max
Eployee,19.0,1010.157895,5.871429,1001.0,1005.5,1010.00,1014.5,1020.0
YearOFExp,17.0,2.382353,1.118445,1.0,1.5,2.25,3.0,5.0
Sal,18.0,2416.666667,1026.559073,1000.0,1562.5,2250.00,3000.0,4500.0

In [111]:
DF5['Sal'].describe().T

count      18.000000
mean     2416.666667
std      1026.559073
min      1000.000000
25%      1562.500000
50%      2250.000000
75%      3000.000000
max      4500.000000
Name: Sal, dtype: float64